Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes Properties
The AnalysisPartAreaAttributes type exposes the following members.
Properties
Name | Description
AreaElementSizeHoles
 Gets or sets the area element size holes.
AreaElementSizeX
 Gets or sets the area element size X.
AreaElementSizeY
 Gets or sets the area element size Y.
AreaElementType
 Gets or sets the area element type.
AreaRotationXY
 Gets or sets the area rotation XY.
AreaStartNumber
 Gets or sets the start number of the area.
AreaSupport |  Obsolete.
 Gets or sets the area support.
AreaSupportType
 Gets or sets the area support type.
MinimumAreaHoleSize
 Gets or sets the minimum area hole size.
RigidDiaphragmFilterName
 Gets or sets the filter name of the rigid diaphragm.
UseSimpleArea
 Gets or sets a value indicating whether simple areas are used.
Top
See Also
Reference
AnalysisPartAreaAttributes Class
Tekla.Structures.Analysis Namespace